import functionsToBeTested
import xml.dom.minidom
#Χρειάζεται το παρακάτω αρχείο να έχει γίνει extract
dom = xml.dom.minidom.parse('BODS_PF0007157_14_20220129_0.xml')

expected_answer=[['07:26:00', '07:45:00', '07:56:00', '08:26:00', '08:56:00', '09:56:00', '10:56:00', '11:56:00', '12:56:00', '13:56:00', '15:15:00', '14:56:00', '15:26:00', '15:56:00', '16:26:00', '16:56:00', '17:56:00'], {'07:26:00': 'JP1', '07:45:00': 'JP2', '07:56:00': 'JP3', '08:26:00': 'JP4', '08:56:00': 'JP3', '09:56:00': 'JP3', '10:56:00': 'JP3', '11:56:00': 'JP3', '12:56:00': 'JP3', '13:56:00': 'JP3', '15:15:00': 'JP5', '14:56:00': 'JP3', '15:26:00': 'JP3', '15:56:00': 'JP3', '16:26:00': 'JP6', '16:56:00': 'JP3', '17:56:00': 'JP6'}]
def test_testFunc():
    output = functionsToBeTested.getDeps('Monday','5',dom)
    assert output==expected_answer